/*
 Navicat MySQL Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50719
 Source Host           : localhost
 Source Database       : ring

 Target Server Type    : MySQL
 Target Server Version : 50719
 File Encoding         : utf-8

 Date: 11/30/2018 02:14:34 AM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `t_dictionary`
-- ----------------------------
DROP TABLE IF EXISTS `t_dictionary`;
CREATE TABLE `t_dictionary` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `col` varchar(20) DEFAULT NULL COMMENT '字段名-表名',
  `name` varchar(20) DEFAULT NULL COMMENT '字段名-中文',
  `code` varchar(5) DEFAULT NULL COMMENT '值',
  `describ` varchar(20) DEFAULT NULL COMMENT '描述',
  `flag` varchar(2) DEFAULT '1' COMMENT '1:可用 0 ：不可用',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `t_dictionary`
-- ----------------------------
BEGIN;
INSERT INTO `t_dictionary` VALUES ('1', 'sex', '性别', '1', '男', '1'), ('2', 'sex', '性别', '0', '女', '1'), ('4', 'marriage', '婚姻状况', '0', '未婚', '1'), ('5', 'marriage', '婚姻状况', '1', '离异', '1'), ('6', 'marriage', '婚姻状况', '2', '丧偶', '1'), ('9', 'examine', '审核状态', '1', '已审核', '1'), ('10', 'location', '地区', '1', '市南区', '1'), ('11', 'location', '地区', '2', '市北区', '1'), ('12', 'location', '地区', '3', '崂山区', '1'), ('13', 'location', '地区', '4', '城阳区', '1'), ('14', 'remindType', '提醒类型', '1', '定时提醒', '1'), ('15', 'remindType', '提醒类型', '2', '提前提醒', '1'), ('16', 'flag', '积分是否冻结', '1', '有效', '1'), ('17', 'flag', '积分是否冻结', '0', '冻结', '1'), ('18', 'inviteStates', '约会状态', '1', '已发出邀请', '1'), ('19', 'examine', '审核状态', '2', '冻结', '1'), ('20', 'examine', '审核状态', '3', '黑名单', '1'), ('21', 'degree', '学历', '1', '本科', '1'), ('22', 'degree', '学历', '2', '研究生', '1'), ('23', 'houseStatus', '住房状态', '1', '租房', '1'), ('24', 'houseStatus', '住房状态', '2', '自有', '1'), ('25', 'inviteStates', '邀约状态', '2', '接收邀请', '1'), ('26', 'inviteStates', '邀约状态', '3', '拒绝', '1'), ('27', 'examine', '审核状态', '0', '待审核', '1'), ('28', 'children', '子女人数', '0', '无', '1'), ('29', 'children', '子女人数', '1', '1人', '1'), ('30', 'children', '子女人数', '2', '2人', '1'), ('31', 'children', '子女人数', '3', '3人', '1'), ('32', 'degree', '学历', '1', '初中', '1'), ('33', 'degree', '学历', '2', '高中/中专', '1'), ('34', 'degree', '学历', '3', '大专', '1'), ('35', 'degree', '学历', '4', '本科', '1'), ('36', 'degree', '学历', '5', '双学士', '1'), ('37', 'degree', '学历', '6', '硕士', '1'), ('38', 'degree', '学历', '7', '双硕士', '1'), ('39', 'degree', '学历', '8', '博士及以上', '1'), ('40', 'houseStatus', '住房状态', '1', '和家人同住', '1'), ('41', 'houseStatus', '住房状态', '2', '购房无按揭', '1'), ('42', 'houseStatus', '住房状态', '3', '购房有按揭', '1'), ('43', 'houseStatus', '住房状态', '4', '租房', '1'), ('44', 'houseStatus', '住房状态', '5', '单位宿舍', '1'), ('45', 'houseStatus', '住房状态', '6', '打算婚后购房', '1'), ('46', 'houseStatus', '住房状态', '7', '两套以上', '1'), ('47', 'income', '税前月薪', '1', '1000-3000', '1'), ('48', 'income', '税前月薪', '2', '3000-5000', '1'), ('49', 'income', '税前月薪', '3', '5000-8000', '1'), ('50', 'income', '税前月薪', '4', '8000-10000', '1'), ('51', 'income', '税前月薪', '5', '10000-15000', '1'), ('52', 'income', '税前月薪', '6', '15000以上', '1'), ('53', 'loca', '所在地', '1', '青岛', '1'), ('54', 'loca', '所在地', '2', '省内', '1'), ('55', 'loca', '所在地', '3', '国内', '1'), ('56', 'loca', '所在地', '4', '国外', '1'), ('57', 'addtress', '活动区域', '1', '市南', '1'), ('58', 'addtress', '活动区域', '2', '市北', '1'), ('59', 'addtress', '活动区域', '3', '李沧', '1'), ('60', 'addtress', '活动区域', '4', '崂山', '1'), ('61', 'addtress', '活动区域', '5', '即墨', '1'), ('62', 'addtress', '活动区域', '6', '其他', '1'), ('63', 'admin', '主办方', '1', '无名指之约', '1'), ('64', 'admin', '主办方', '2', '个人', '1'), ('65', 'admin', '主办方', '3', '团体', '1'), ('66', 'actForm', '活动形式', '1', '沙龙', '1'), ('67', 'actForm', '活动形式', '2', '户外', '1'), ('68', 'actForm', '活动形式', '3', '趴体', '1'), ('70', 'actState', '活动状态', '1', '活动发起', '1'), ('71', 'actState', '活动状态', '2', '活动预热', '1'), ('72', 'actState', '活动状态', '3', '活动报名', '1'), ('73', 'actState', '活动状态', '4', '活动中', '1'), ('74', 'actState', '活动状态', '5', '已取消', '1'), ('75', 'actState', '活动状态', '6', '活动结束', '1'), ('76', 'detailState', '参加状态', '0', '已取消', '0'), ('77', 'detailState', '参加状态', '1', '已申请', '1'), ('78', 'detailState', '参加状态', '2', '已同意', '1'), ('79', 'detailState', '参加状态', '3', '已缴费', '1'), ('80', 'detailState', '参加状态', '4', '已退出', '1'), ('81', 'detailState', '参加状态', '5', '已结束', '1'), ('82', 'detailState', '参加状态', '6', '未参加', '1'), ('83', 'detailState', '参加状态', '7', '已拒绝', '1'), ('84', 'compare', '是否系统内描述一致', '1', '严重不符', '1'), ('85', 'compare', '是否系统内描述一致', '2', '基本不符', '1'), ('86', 'compare', '是否系统内描述一致', '3', '基本相符', '1'), ('87', 'compare', '是否系统内描述一致', '4', '与描述一致', '1'), ('88', 'compare', '是否系统内描述一致', '5', '超出预期', '1'), ('89', 'next', '是否期待下一次约会', '1', '再也不见', '1'), ('90', 'next', '是否期待下一次约会', '2', '看情况而定', '1'), ('91', 'next', '是否期待下一次约会', '3', '对方约我，我会考虑', '1'), ('92', 'next', '是否期待下一次约会', '4', '对方约我我就去', '1'), ('93', 'next', '是否期待下一次约会', '5', '主动邀约对方', '1'), ('94', 'late', '是否迟到', '1', '未迟到', '1'), ('95', 'late', '是否迟到', '2', '迟到十分钟以内', '1'), ('96', 'late', '是否迟到', '3', '10分-30分', '1'), ('97', 'late', '是否迟到', '4', '30分-1小时', '1'), ('98', 'late', '是否迟到', '5', '一小时以上', '1'), ('99', 'late', '是否迟到', '6', '未赴约或当天取消', '1'), ('100', 'talk', '是否健谈', '1', '有吵架，翻脸等', '1'), ('101', 'talk', '是否健谈', '2', '经常冷场', '1'), ('102', 'talk', '是否健谈', '3', '偶尔交流', '1'), ('103', 'talk', '是否健谈', '4', '正常交流', '1'), ('104', 'talk', '是否健谈', '5', '相谈甚欢', '1'), ('105', 'examine', '会员状态', '0', '待审核', '1'), ('106', 'examine', '会员状态', '2', '冻结', '1'), ('107', 'actState', '活动状态', '0', '待审核', '1'), ('108', 'articleState', '文章状态', '0', '草稿', '1'), ('109', 'articleState', '文章状态', '1', '审核中', '1'), ('110', 'articleState', '文章状态', '2', '美文', '1'), ('111', 'articleState', '文章状态', '3', '精品', '1'), ('112', 'articleState', '文章状态', '4', '置顶', '1'), ('113', 'articleType', '文章类型', '1', '游记', '1'), ('114', 'articleType', '文章类型', '2', '美食', '1'), ('115', 'articleType', '文章类型', '3', '健康', '1'), ('116', 'articleType', '文章类型', '4', '感想', '1');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
